---
type: ElementIntersectsSolidFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementIntersectsSolidFilter

`Autodesk.Revit.DB.ElementIntersectsSolidFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementIntersectsSolidFilter | — | `` |
| Method | GetSolid | 2012 | `public Solid GetSolid ()` |
| Method | PassesFilter | — | `` |